import '@/styles/login.css';

export default function LoginLayout({ children }) {
  return (
    <div className="login-container">
      <div className="login-left">
        <h1>🏫 โรงเรียนบ้านเลยเสย</h1>
        <p>ระบบฐานข้อมูลบุคลากรเพื่อการศึกษา</p>

        <ul>
          <li>✔ จัดการข้อมูลอย่างเป็นระบบ</li>
          <li>✔ ปลอดภัยและรวดเร็ว</li>
          <li>✔ เข้าถึงได้ทุกที่ทุกเวลา</li>
        </ul>
      </div>

      <div className="login-right">
        {children}
      </div>
    </div>
  );
}
